# Boolean - 3 состояния

# b = bool
#
# t = True
# f = False
# n = None

# if/elif/else если, иначе, еще

# code = 400
# if 200 <= code < 400:  # Если код больше 200/равен 200/меньше 400, то проверка пройдена
#     print("Проверка пройдена, хороший ответ!")
# elif 400 <= code < 600:  # Иначе если код больше 400/равен 400/меньше 600, то это плохой код ответа
#     print("Плохой код ответа")
# else:  # иначе какой-либо другой код
#     print("Какой-то странный код")

# user_list = []
#
# if user_list == []:
#     print("Пройден")
# else:
#     print("Не пройден")
#
# if user_list:
#     print("Пройден")
# else:
#     print("Не пройден")
